УТ_для_edt/src/Catalogs/смартГрузы/смартГрузы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартГрузы</name>
  <attributes>
    <name>ПланируемаяДатаПоступления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Принят</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаЗадержки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентНаценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партнёр</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусГруза</name>
    <type>
      <types>EnumRef.СтатусыГрузов</types>
    </type>
  </attributes>
  <attributes>
    <name>смарт_НомерТаможеннойДекларации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/InformationRegisters/смартСобытияКонтейнеров/смартСобытияКонтейнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартСобытияКонтейнеров</name>
  <dimensions>
    <name>Груз</name>
    <type>
      <types>CatalogRef.смартГрузы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контейнер</name>
    <type>
      <types>CatalogRef.смартКонтейнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СодержаниеСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Catalogs/смартГрузы/Forms/ФормаСписка/Module.bsl
&НаСервере
//++ #Б-3612 смарт: Фролов 25.06.2025 //Вывести колонку "Контейнер" в список "Грузы(смарт)"
Функция КонтейнерПриИзмененииНаСервере()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Груз КАК Груз
	|ИЗ
	|	РегистрСведений.смартСобытияКонтейнеров
	|ГДЕ
	|	Контейнер = &Контейнер");
	Запрос.УстановитьПараметр("Контейнер", Контейнер);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Груз");

КонецФункции //-- #Б-3612 смарт: Фролов 25.06.2025

&НаКлиенте
//++ #Б-3612 смарт: Фролов 25.06.2025 //Вывести колонку "Контейнер" в список "Грузы(смарт)"
Процедура КонтейнерПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Контейнер) Тогда
		
		Грузы = КонтейнерПриИзмененииНаСервере();
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", Грузы, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
		
	Иначе	
	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", , , , Ложь);
	
	КонецЕсли;
	
КонецПроцедуры //-- #Б-3612 смарт: Фролов 25.06.2025
